
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'ack'
brew 'act'
brew 'allure'
brew 'aom'
brew 'aribb24'
brew 'awscli'
brew 'awsume'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cask'
brew 'cffi'
brew 'cjson'
brew 'colordiff'
brew 'coreutils'
brew 'cryptography'
brew 'ctags'
brew 'curl'
brew 'dav1d'
brew 'diff-so-fancy'
brew 'diffnav'
brew 'docker'
brew 'docker-completion'
brew 'emacs'
brew 'eza'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gd'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'gpgme'
brew 'gpgmepp'
brew 'graphite2'
brew 'graphviz'
brew 'gts'
brew 'harfbuzz'
brew 'highway'
brew 'hub'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'icu4c@78'
brew 'imath'
brew 'jansson'
brew 'jasper'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'lame'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libdeflate'
brew 'libevent'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libudfread'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'lua-language-server'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'markdown'
brew 'mas'
brew 'mbedtls'
brew 'mbedtls@3'
brew 'mecab'
brew 'mise'
brew 'mpdecimal'
brew 'mpg123'
brew 'msgpack'
brew 'mysql'
brew 'mysql-client'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nginx'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjpeg'
brew 'openjph'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'pango'
brew 'pcre2'
brew 'peco'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'poppler'
brew 'postgresql@14'
brew 'pre-commit'
brew 'prettier'
brew 'protobuf'
brew 'protobuf@29'
brew 'pycparser'
brew 'python-packaging'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.14'
brew 'rav1e'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'sdl2'
brew 'simdjson'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'ssh-copy-id'
brew 'starship'
brew 'svt-av1'
brew 'tailwindcss-language-server'
brew 'tesseract'
brew 'thefuck'
brew 'theora'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'typos-cli'
brew 'unbound'
brew 'unibilium'
brew 'usage'
brew 'utf8proc'
brew 'uvwasi'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'adobe-acrobat-reader'
cask 'arc'
cask 'aws-vault-binary'
cask 'chatgpt'
cask 'claude'
cask 'cursor'
cask 'deskpad'
cask 'discord'
cask 'font-hack-nerd-font'
cask 'font-hackgen'
cask 'font-hackgen-nerd'
cask 'kiro'
cask 'microsoft-edge'
cask 'notion'
cask 'notion-calendar'
cask 'obsidian'
cask 'orbstack'
cask 'postman'
cask 'raycast'
cask 'session-manager-plugin'
cask 'tableplus'
cask 'thebrowsercompany-dia'
cask 'visual-studio-code'
cask 'wezterm'
cask 'zed'
cask 'zen'
cask 'zoom'

tap 'aws/tap'
brew 'copilot-cli'

tap 'daipeihust/tap'
brew 'im-select'

tap 'dlvhdr/formulae'

tap 'kayac/tap'
brew 'ecspresso'

tap 'laishulu/homebrew'
brew 'macism'

tap 'olets/tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sanemat/font'

tap 'yukiarrr/tap'
brew 'ecsk'

# Other Homebrew packages
brew 'codex'

# App Store applications
mas 'Amazon Kindle (7.46.1)', id: 302584613
mas 'Amphetamine (5.3.2)', id: 937984704
mas 'Keynote (14.2)', id: 409183694
mas 'Kindle (1.40.3)', id: 405399194
mas 'Magnet (3.0.7)', id: 441258766
mas 'Numbers (14.2)', id: 409203825
mas 'Pages (14.2)', id: 409201541
mas 'Slack (4.46.99)', id: 803453959
mas 'Xcode (16.4)', id: 497799835
