
# tap repositories and their packages

tap 'homebrew/core'
brew 'ack'
brew 'act'
brew 'aom'
brew 'aribb24'
brew 'awscli'
brew 'awsume'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cask'
brew 'cffi'
brew 'cjson'
brew 'colordiff'
brew 'coreutils'
brew 'cryptography'
brew 'ctags'
brew 'curl'
brew 'dav1d'
brew 'diff-so-fancy'
brew 'emacs'
brew 'eza'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gpgme'
brew 'graphite2'
brew 'harfbuzz'
brew 'highway'
brew 'hub'
brew 'icu4c'
brew 'imath'
brew 'jansson'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'lame'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libevent'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libmicrohttpd'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'librist'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'lua-language-server'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'markdown'
brew 'mas'
brew 'mbedtls'
brew 'mecab'
brew 'mpdecimal'
brew 'mpg123'
brew 'msgpack'
brew 'mysql'
brew 'mysql-client'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'nginx'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'pango'
brew 'pcre2'
brew 'peco'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'poppler'
brew 'pre-commit'
brew 'prettier'
brew 'protobuf@21'
brew 'pycparser'
brew 'python@3.11'
brew 'python@3.12'
brew 'rav1e'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'sdl2'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'ssh-copy-id'
brew 'svt-av1'
brew 'tailwindcss-language-server'
brew 'tesseract'
brew 'thefuck'
brew 'theora'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'deepl'
cask 'font-hack-nerd-font'
cask 'font-hackgen'
cask 'font-hackgen-nerd'
cask 'google-chrome'
cask 'notion-calendar'
cask 'obsidian'
cask 'orbstack'
cask 'postman'
cask 'raycast'
cask 'session-manager-plugin'
cask 'tableplus'
cask 'visual-studio-code'
cask 'wezterm'

tap 'homebrew/bundle'

tap 'olets/tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sanemat/font'

tap 'yukiarrr/tap'
brew 'ecsk'

# App Store applications
mas 'Amazon Kindle (7.15.1)', id: 302584613
mas 'Keynote (14.0)', id: 409183694
mas 'Magnet (2.14.0)', id: 441258766
mas 'Numbers (14.0)', id: 409203825
mas 'Pages (14.0)', id: 409201541
mas 'Slack (4.39.95)', id: 803453959
mas 'Xcode (15.4)', id: 497799835
